def area_square(a):
    """
    Вычисляет площадь квадрата со стороной a.
    Параметр:
        a (float): число с плавающей точкой
        
    Возвращаемое значение:
        area_square(a): площадь квадрата равного произведению a и а. 
    Пример:
        area_square(1):
        1
    """
    return a * a

def perimeter_square(a):
    """
    Вычисляет периметр квадрата со стороной a.
    Параметр:
        a (float): число с плавающей точкой
                
    Возвращаемое значение:
        perimeter_square(a): периметр квадрата равного a * 4
    Пример:
        perimeter_square(1):
        4
    """
    return 4 * a
